/*
МЕТОД: find()
ЩО РОБИТЬ: Шукає в масиві ПЕРШИЙ елемент, який підходить під твою умову (коли стрілочна функція повертає true).
ГОЛОВНА ФІШКА: Він не створює новий масив! Він повертає саме ЗНАЧЕННЯ цього одного елемента. 
Як тільки знаходить перше співпадіння — одразу зупиняється і далі масив не читає. Якщо нічого не знайшов — видасть undefined.
*/

// створюю масив чисел
const storageOptions = [128, 256, 512, 1024, 2048];

// створюю стрілкову функцію для пошуку підходящого мені числа

const optimalDrive = storageOptions.find (storage => storage >= 500);
// друк у консоль
console.log(optimalDrive);