/*
МЕТОД: map()
ЩО РОБИТЬ: Перебирає оригінальний масив, трансформує КОЖЕН його елемент за допомогою колбек-функції і повертає абсолютно НОВИЙ масив такого ж розміру.
ГОЛОВНА ФІШКА: Початковий масив залишається незмінним. Метод ідеально підходить, коли треба змінити формат усіх даних
(наприклад, перевести всі ціни з доларів у злоті або піднести числа до квадрата).
*/

// створюю звичайний масив
const numbers = [2, 5, 8, 10] 

// стрілочна функція з використовуванням map для створення нового масиву із числами в квадраті
const squaredNumbers = numbers.map(number => number * number);
// друк нового масиву у консоль
console.log(squaredNumbers);