/*
МЕТОД: filter()
ЩО РОБИТЬ: Працює як фейсконтроль або сито. Перебирає масив і повертає НОВИЙ масив, у який потрапляють ТІЛЬКИ ТІ елементи,
які пройшли перевірку (тобто стрілочна функція-приклад повертає true).
ГОЛОВНА ФІШКА: Новий масив зазвичай менший за оригінальний (або такий самий, якщо підійшли всі).
Якщо жоден елемент не пройшов перевірку, метод просто поверне порожній масив [].
*/

// створюю звичайний масив із числами 
const clientAges = [16, 22, 15, 35, 18, 12]

// створюю стрілкову функцію для перебору потрібних мені чисел
const adultClients = clientAges.filter(age => age >= 18);
// друк нового масиву у консоль
console.log(adultClients);